dev_lat = {
    '्' : '̖',
    'ा' : 'ā',
    'ि' : 'ı',
    'ी' : 'ī',
    'ु' : 'u',
    'ू' : 'ū',
    'े' : 'e',
    'ै' : 'ē',
    'ो' : 'o',
    'ौ' : 'ō',

    'ृ' : 'ṛ',
    'ॄ' : 'ṝ',
    'ॢ' : 'ḷ',
    'ॣ' : 'ḹ',

    'ं' : '̇',
    'ः' : ':',
    'ँ' : '̐',
    '॑' : '̍',
    '॒' : '̱',
    '᳚' : '̎',
    'ॐ' : 'O̐',

    'अ' : 'A',
    'आ' : 'Ā',
    'इ' : 'I',
    'ई' : 'Ī',
    'उ' : 'U',
    'ऊ' : 'Ū',
    'ए' : 'E',
    'ऐ' : 'Ē',
    'ओ' : 'O',
    'औ' : 'Ō',

    'ऋ' : 'Ṛ',
    'ॠ' : 'Ṝ',
    'ऌ' : 'Ḷ',
    'ॡ' : 'Ḹ',

    'क' : 'k',
    'ख' : 'ḳ',
    'ग' : 'g',
    'घ' : 'g̣',
    'ङ' : 'n̰',

    'च' : 'c',
    'छ' : 'c̣',
    'ज' : 'ȷ',
    'झ' : 'ȷ̣',
    'ञ' : 'ñ',

    'ट' : 'ŧ',
    'ठ' : 'ŧ̣',
    'ड' : 'đ',
    'ढ' : 'đ̣',
    'ण' : 'ṇ',

    'त' : 't',
    'थ' : 'ṭ',
    'द' : 'd',
    'ध' : 'ḍ',
    'न' : 'n',

    'प' : 'p',
    'फ' : 'p̣',
    'ब' : 'b',
    'भ' : 'ḅ',
    'म' : 'm',

    'य' : 'y',
    'र' : 'r',
    'ल' : 'l',
    'ळ' : 'l̤',
    'व' : 'v',

    'श' : 'ṣ',
    'ष' : 's̰',
    'स' : 's',
    'ह' : 'h',
    
}


def convert(tex):
    conv = ""
    for n, c in enumerate(tex):
        if c in dev_lat:

            #gm check
            if (c=='॒' or c =='॑') and tex[n-1]=='ꣳ':
                conv += c
            
            #convert
            else: conv += dev_lat[c]

        else:
            conv+=c

    print(conv)
    return conv


with open('text.txt','r',encoding='utf-8') as rf:
    text = rf.read()

wr = convert(text)

with open('converted.txt','w',encoding='utf-8') as file:
    file.write(wr)


